{"greedy": ["Sliver dodecahedron| Creature — Human Cleric| {2}{W}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"The gods have given us a gift of life, but we have no choice but to accept it.\" line_break —Gerrard of the *Weatherlight* end_of_card Gerrard of the *Weatherlight*| Creature — Human Cleric| {2}{W}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"The gods have given us"], "beam_5": ["Sliver dodecahedron| Artifact — Equipment| {2}| uncommon| Equipped creature gets +2/+2. line_break Equip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)| None| None| None| None end_of_card Goblin Scout| Artifact Creature — Goblin Scout| {3}| uncommon| Whenever Goblin Scout", "Sliver dodecahedron| Artifact — Equipment| {2}| uncommon| Equipped creature gets +2/+2. line_break Equip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)| None| None| None| None end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{G}| common| Whenever Goblin", "Sliver dodecahedron| Artifact — Equipment| {2}| uncommon| Equipped creature gets +2/+2. line_break Equip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)| None| None| None| None end_of_card Goblin Scout| Artifact Creature — Goblin Scout| {3}| common| Goblin Scout can", "Sliver dodecahedron| Artifact — Equipment| {2}| uncommon| Equipped creature gets +2/+2. line_break Equip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)| None| None| None| None end_of_card Goblin Scout| Artifact Creature — Goblin Scout| {3}| common| Goblin Scout gets", "Sliver dodecahedron| Artifact — Equipment| {2}| uncommon| Equipped creature gets +2/+2. line_break Equip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)| None| None| None| None end_of_card Goblin Scout| Artifact Creature — Goblin Scout| {3}| common| Goblin Scout enters"], "sample_k=0_p=0_t=1": ["Sliver dodecahedron| Creature — Dragon| {3}{R}{R}| rare| Wherever creatures can't block, those creatures on the battlefield gain combater experience equal to the number of druids they're blocking. (Only creatures that share a stage with you can have combater.) line_break When Forsaken creatures enter the battlefield, choose three, then each other creature they control gains combater skill until end of turn. Activate this ability only if both have combater.| 2| 4| None| None end_of_card Gemmine Giant| Creature — Giant Warrior| {2}{R", "Sliver dodecahedron| Creature — Human Warrior| {3}{W}| common| Vigilance (This creature can't be blocked except by artifact creatures and/or black creatures.)| 2| 3| None| Tactician Yuvi's citadel is teeming with tactical cobbles. But those the civilized peoples of the Keldons of the Isle of Uzzet seem to ignore, or fade completely out into the ether. end_of_card Bumblebee| Creature — Emissary| {W}| common| When Bumblebee dies, discard cards equal to the number of colors learned in", "Sliver dodecahedron| Creature — Human Wizard| {4}{B}| common| Flash (You may cast this spell any time you could cast an instant.) line_break At the beginning of your upkeep, you gain 4 life.| 3| 4| None| \"No more clocks, and let's put the pageant down to date.\" end_of_card Jagged Fading Minion| Creature — Minion| {2}{U}{B}| uncommon| Flying line_break At the beginning of each end step, if no spells were cast this turn, Jagged Fading Minion discards a card", "Sliver dodecahedron| Creature — Aura Avenger| {G}| uncommon| Vigilance 6 (This creature can't be blocked except by artifact creatures and/or black creatures.) line_break When Haste enters the battlefield, remove a charge counter from all non-black creatures it's tied to.| 1| 2| None| Her instrument is good gauze. end_of_card Monstrosity Clock| Artifact Creature — Mirari Charm| {2}| common| {2}, {T}: Destroy target instant and sorcery spell unless its controller pays {3}.| 2| 2| None| \"Ever", "Sliver dodecahedron 3| 4| None| The creature tumbled over the clouds with a ghastly wannabe who then set off on his errands for more murderous frolicking. end_of_card Steldoxodon Pirate| Creature — Volrath Pirate| {3}{G}| rare| Flying line_break When Weldoxodon Pirate enters the battlefield, sacrifice Quick Draw order and a creature. line_break Whenever Weldoxodon Pirate deals combat damage to a player, you may turn all Island cards with trample from all graveyards and creatures you control face down and exile them"], "sample_k=0_p=0_t=.7": ["Sliver dodecahedron| Creature — Insect| {4}{B}| rare| Flying line_break {4}{B}: Regenerate target creature.| 2| 2| None| The horned horn of the kor were a warning sign of the future. end_of_card Predator| Creature — Insect| {2}{B}| rare| Insects you control have deathtouch. line_break When Predator dies, it deals damage equal to its power to target creature you control and each other creature you control.| 2| 2| None| \"The kor prefer to be eaten by", "Sliver dodecahedron| Artifact Creature — Crab| {4}{R}| rare| When Spiral dodecahedron enters the battlefield, you may exile target creature an opponent controls. Create a 1/1 red Insect creature token.| 2| 3| None| \"It's a bit of everything, but it's not quite as fragile as I'd expect.\" end_of_card Spiral at the Sea| Sorcery| {1}{R}| rare| Choose a color. Search your library for up to two basic lands that share a color, reveal them, put them into your hand, then", "Sliver dodecahedron| Creature — Cat| {2}{U}| common| When Cutter dodecahedron enters the battlefield, you may search your library for a basic land card, reveal that card, put it into your hand, then shuffle your library.| 1| 3| None| None end_of_card Cave Serpent| Creature — Serpent| {3}{U}| common| Exile target creature an opponent controls.| 1| 3| None| The jungle has him made. end_of_card Dinosaurs| Creature — Dinosaur| {3}{U}| common| Din", "Sliver dodecahedron| Creature — Snake Warrior| {2}{R}| common| Flash (You may cast this spell any time you could cast an instant.) line_break Whenever another Snake creature enters the battlefield under your control this turn, you may pay {R}. If you do, shuffle all the other Snake creatures into their owner's library.| 2| 2| None| None end_of_card Nodelan Drone| Creature — Insect| {R}| common| {R}, {T}: Add {R}.| 1| 1| None| \"The only thing more dangerous than the", "Sliver dodecahedron| Creature — Elemental| {4}{G}| rare| Flying line_break When Vedalken Rogue enters the battlefield, if it's your turn, draw a card.| 3| 3| None| All creatures are connected, even the telepaths who know them best. end_of_card Vedalken Broodclaw| Creature — Zombie Broodclaw| {3}{G}| common| Landfall — Whenever another creature enters the battlefield under your control, create a 1/1 red Zombie creature token. line_break When Vedalken Broodclaw enters the"], "sample_k=50_p=0_t=1": ["Sliver dodecahedron| Creature — Dryad Wizard| {1}{R}| common| {1}{R}, {T}: Target creature gains the creature type of its controller until end of turn. Activate this ability only once each turn.| 2| 1| None| As its wings fly, the creature sees death in its eyes and knows to stay the course. end_of_card Guildscreechers| Creature — Goblin Wizard| {2}{R}| uncommon| {X}{R}: Guildscreechers gets -X/-X until end of turn, where X is the greatest strength among Elves.| 2| 2| None| \"If we can win the games, everyone will feel the pride of the dwarves and the pride of the Guildscreechers.\" line_break —*Guildscreechers* end_of_card Lit-Clan Troll {2}{R}| common| Whenever a permanent you control becomes tied for first on a player's devotion, you may mill two cards.| 3| 1| None| None end_of_card Neuromancer's Charm| Sorcery| {2}{R}| uncommon| Choose two target creatures; put all other creatures", "Sliver dodecahedron| Creature — Sliver| {5}{W}{B}| uncommon| Flying, first strike| 3| 5| None| In the flesh of the fallen, their strength surges in both strength and horror. end_of_card Kruphix| Creature — Human Cleric| {5}{G}{U}| uncommon| {1}{G}, {T}, Sacrifice Kruphix: You may return target unspent mana from your graveyard to your hand.| 2| 2| None| The slivers of his tongue are the only things that keep him alive and in his home. end_of_card Nettlebrook| Enchantment| {4}{W}{U}| rare| None| None| None| \"What is food? Who eats a bog? Who eats a pond?\" line_break —Ladrik, *Khenrei Tales* end_of_card Nubba, the Dragon-Kin| Legendary Planeswalker — Nubba- {3}{B}{R}| mythic| [+1]: You gain 1 life. line_break [−1]: You gain 2 life. line_break [−5]: Regenerate target creature.", "Sliver dodecahedron| Creature — Hydra Beast| {3}{B}| rare| Flying line_break Whenever Scourge dodecahedron attacks alone while attacking a player, you may return target other creature card from your graveyard to your hand.| 3| 3| None| \"We are all worthy of our fate. We will do our duty regardless of whose fault we are.\" end_of_card Skyrider Giantlord| Creature — Ogre Warrior| {2}{B}{B}| rare| Trample line_break At the beginning of your upkeep, sacrifice Skyrider Giantlord unless you pay {B}. line_break {B}, Sacrifice a land: Skyrider Giantlord deals 2 damage to you.| 2| 2| None| \"There is no greater honor than this.\" line_break —Uther Nalaar end_of_card Skywrath Elemental| Creature — Elemental| {3}{B}{B}| rare| Flying line_break Whenever Skywrath Elemental deals combat damage to a player, that player loses 2 life, where X is the number of green or red creature cards in their graveyard.| 3| 3| None| Its body is composed mostly of stone and its breath is", "Sliver dodecahedron (This creature can attack and {T} as soon as it comes under your control. It can't be blocked except by two or more creatures.) line_break {1}{R}, Sacrifice a Dinosaur: Exile Return Cobra Dinosaur from your graveyard to the battlefield.| None| None| None| \"In the time they live, they will be free to devour the earth's seed.\" line_break —Bosin, goblin guide end_of_card Eerie Stinking Salamander| Creature — Salamander| {2}{R}{R}| uncommon| Whenever a creature your opponents control deals damage to or blocks an opponent this turn, draw a card.| 3| 4| None| \"This is life!\" end_of_card Harsh Desecration| Sorcery| {R}| uncommon| Exile all creature cards that are black, red, blue, and/or green.| None| None| None| The land and the sea must be free of fear. end_of_card Incapacitating Fire| Sorcery| {R}| uncommon| Flash (You may cast this spell any time you would draw a card from your hand.) line_break Flash (You", "Sliver dodecahedron| Creature — Elf Druid| {B}{B}{B}| rare| When Spiral Dodecahedron enters the battlefield, create a 2/2 red Elf creature token with trample and lifelink.| 2| 2| None| Even in its most remote and cruel habitat, a forest's last stand is the last. end_of_card Stagemag Thalmor| Creature — Human Ogre| {3}{B}{B}| rare| Stride (Whenever this creature and/or an opponent walk or attack, this creature gets +1/+1 until end of turn.) line_break When Stagemag Thalmor enters the battlefield, if it has no +1/+1 counters on it, draw a card.| 7| 8| None| \"We are his enemies. Our enemies.\" end_of_card Tanglewood Scavenger| Creature — Human Samurai| {3}{B}| uncommon| Trample line_break When Tanglewood Scavenger enters the battlefield, create a 3/3 green Beast creature token. line_break • Create a 4/4 black Elemental creature token. line_break • Create a 2/2 black Frog creature token"], "sample_k=0_p=.92_t=1": ["Sliver dodecahedron| Creature — Dryad Wizard| {1}{R}| common| {1}{R}, {T}: Converge target creatures you control with converted mana cost 3 or less and up to two target creature cards with converted mana cost 2 or less from their graveyard onto the battlefield.| 1| 1| None| They tend to forget to release extra bonds from their prongs and weave them into new objects. end_of_card Emissary of the Second Seal| Creature — Angel| {1}{R}{R}| rare| Flying line_break Menace line_break When this creature enters the battlefield, draw a card.| 1| 2| None| Even mortals can feel the shimmering of the wings. end_of_card Lust for Life| Sorcery| {2}{G}| common| Exile all lands with a higher converted mana cost.| None| None| None| \"Mystic folly does not endanger my cherished duty.\" line_break —Sarkhan Vess end_of_card Nadix Hope Keep| Creature — Zombie Bird Ally| {2}{G}| uncommon| Protection from black line_break Whenever Nadix Hope Keep or another Ally enters the", "Sliver dodecahedron| Creature — Sliver| {5}{W}{W}| rare| Flying, first strike| 3| 3| None| In the hinterlands of Morrathi, lurkers turn up the heat with gruesome abandon. They prowl the streets for illegal activity, but end up finding what they seek most: illicit ivory. end_of_card Leech| Artifact| {1}| common| {T}: Choose a card type. Add {C}. line_break When you cast a creature spell with converted mana cost 5 or less, put it on top of its owner's library.| None| None| None| None end_of_card Limousine Ash| Artifact| {1}| common| {T}: Add {U}. line_break When you cast a creature spell with converted mana cost 5 or less, put it onto the battlefield tapped. line_break When you cast a creature spell with converted mana cost 5 or less, tap Limousine Ash.| None| None| None| None end_of_card Mjöldor Battlefield| Land| None| common| {T}: Add {C}. line_break As long as two or more cards", "Sliver dodecahedron| Creature — Hydra Beast| {3}{B}| rare| Flying line_break Whenever Scourge dodecahedron attacks, line_break {B}: Scourge dodecahedron deals 2 damage to target attacking creature.| 3| 2| None| \"We are all worthy of taking advantage of the traps of conflict. In the end, we all stand.\" end_of_card Stonecrack Minotaur| Creature — Minotaur| {4}{B}{B}| rare| Reach (This creature can block creatures with flying.)| 2| 1| None| It clears the forge by twisting many walls together. end_of_card Terran Barrel Gargoyle| Creature — Gargoyle| {1}{B}| rare| Trample line_break {B}: The top card of your library becomes your commander, then you may pay {3}{B}. If you do, return Terran Barrel Gargoyle to its owner's hand.| 2| 1| None| Only their watercolors understand its insatiable hunger. end_of_card Twin Lynx Rats| Creature — Rat| {3}{B}| common| Flying| 3| 2| None| Haven't you ever seen", "Sliver dodecahedron (This creature can't be blocked as long as defending player controls a Swamp.) line_break When Nicol Bolas enters the battlefield, return Scourge creature card from your graveyard to your hand. line_break Equip {2} ({2}: Attach to target creature you control that's attacking or blocking. Equip only as a sorcery.)| None| None| None| None end_of_card Serra's Stinking Molasses| Sorcery| {2}{R}{R}| rare| Cast this spell only during combat on your turn. line_break Add {C}. line_break Whenever a creature you control deals damage to you, the controller may put a card from their hand onto the battlefield.| None| None| None| \"I will be your protector as long as you keep me safe.\" end_of_card Stitcher of Brass // Garth| Creature — Zombie Warrior| {R}{R}| common| Stitcher of Brass has menace. line_break {R}: Stitcher of Brass deals 1 damage to target creature you don't control.| 1| 1| None| The forge upon which it is made is another example of the growing dependence of metal on power. end_of", "Sliver dodecahedron| Creature — Elf Druid| {B}{B}{B}| rare| When Spiral Dodecahedron enters the battlefield, create a 2/2 red Elf creature token with trample and lifelink.| 2| 2| None| Even in its most remote and disgusting habitat, a benevolent god has always protected the weak. end_of_card Starmogoyf| Creature — Dinosaur| {1}{B}| common| Lairfolk Llanowar (This creature can't attack.)| 1| 1| None| Like most mongrels, Starmogoyf began life in the wild as a bug-eating enemy. end_of_card Skybitterhoof| Creature — Elemental Beast| {3}{B}| common| Flying, lifelink (This creature can't attack.) line_break Whenever Skybitterhoof attacks, scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)| 4| 3| None| The angry beasts shoot arrows at every flinch in its wake, as though they were hunting for prey. end_of_card Tealen's Hyster"], "sample_k=50_p=.92_t=1": ["Sliver dodecahedron| Creature — Dryad Wizard| {1}{R}| common| {1}{R}, {T}: Target creature gains the creature type of its controller until end of turn. Activate this ability only once each turn.| 2| 1| None| As its wings fly, the creature sees death in its eyes and knows to stay aloft for much longer. end_of_card Grave Giant| Creature — Giant| {3}{R}| uncommon| {X}{R}: Grave Giant gains deathtouch until end of turn. (Damage and effects that say \"destroy\" don't destroy it. It deals damage to players and planeswalkers equal to its power to the other.)| 1| 3| None| In the wastes of Phyrexia lies a vast labyrinth of pits and crevasses. end_of_card Glyph of Life and Death| Sorcery| {2}{R}{R}| common| Create a 1/1 black Insect creature token with flying. line_break Sacrifice a creature: Draw a card.| None| None| None| \"I don't want it here... I just want to put things up here... \" end_of", "Sliver dodecahedron| Creature — Sliver| {5}{W}{B}| uncommon| Flying, first strike| 3| 5| None| In the flesh of the fallen, their scars will bleed with their own tears. end_of_card Kruphix| Creature — Human Cleric| {5}{R}{G}| uncommon| {1}{R}, {T}, Sacrifice Kruphix: You may return target permanent card from your graveyard to your hand.| 4| 4| None| Kromphix was first introduced in the Gruul lands of Azorius. His power is that of an adept in the ways of death. end_of_card Llanowar| Creature — Elemental| {1}{G}| common| Flying line_break {1}{G}{G}: Gain control of target creature for as long as it remains on the battlefield. line_break Haste line_break {1}{G}{G}: Gain control of target creature for as long as it remains on the battlefield.| 1| 1| None| None end_of_card Mishra| Legendary Creature — Human| {4}{B}{G}| rare| Haste line_break Flying line", "Sliver dodecahedron| Creature — Hydra Beast| {3}{B}| rare| Flying line_break Whenever Scourge dodecahedron attacks, you may put a +1/+1 counter on it.| 2| 2| None| It would serve the necromancer's interest in getting up to speed. end_of_card Shredder's Kithkin| Creature — Skeleton| {2}{B}| uncommon| If a creature would die this turn, sacrifice it. If you do, the next creature you control with the least power gains haste until end of turn.| 3| 3| None| \"They are mindless, mindless beings that never tire of their duties. They do their duty for their own purposes.\" end_of_card Spiteful Stench| Enchantment| {1}{B}| common| {B}, Sacrifice Spoful Stench: Creatures you control have haste until end of turn.| None| None| None| \"No more will the foul smell of decay waft on your nostrils.\" line_break —Erza, Necromancer end_of_card Serpent-Scourge| Creature — Zombie| {B}| common| Whenever Serpent-Scourge blocks or", "Sliver dodecahedron (This creature can't be blocked as long as defending player controls a Swamp.) line_break When Nicol Bolas enters the battlefield, return all creature cards from your graveyard to your hand. line_break Equip {2} ({2}: Attach to target creature you control that's attacking or blocking. Equip only as a sorcery.)| None| None| None| None end_of_card Ravager| Creature — Vedalken Warrior| {2}{R}{R}| rare| {T}: Target red creature gets +1/+2 until end of turn. line_break Trample| 0| 3| None| \"Let the wind guide you as it will guide you.\" end_of_card Renegade| Enchantment| {2}{R}| rare| {1}: Renegade deals 1 damage to each opponent. line_break Whenever another creature you control attacks, you gain 1 life.| None| None| None| \"Death is a matter of life and death is a matter of death.\" line_break —Vessandra the Eternal end_of_card Shattering Blow| Enchantment| {3}{R}| rare| {5}{R}: Shattering", "Sliver dodecahedron| Creature — Elf Druid| {B}{B}{B}| rare| When Spiral Dodecahedron enters the battlefield, create a 2/2 red Elf creature token with trample and lifelink.| 2| 2| None| Even in its most remote and cruel habitat, a forest's last stand is the last. end_of_card Stagemag Thalmor| Creature — Human Pirate| {3}{B}{B}| rare| Flying line_break Flying line_break When Sagemag Thalmor enters the battlefield, gain control of target creature.| 5| 6| None| \"You are only as destructive as your enemies.\" end_of_card Steppe Raider| Creature — Beast| {3}{B}| rare| Haste line_break Cycling {3} ({3}, Discard this card: Draw a card.) line_break Cycling {3} ({3}, Discard this card: Draw a card.)| 4| 4| None| It skids and crashes to the ground, waiting for the next blow. end_of_card Steppe Raiding| Sorcery| {B}| common| Return target creature card from your graveyard to"]}