{"greedy": ["Elf Goblin| {2}{W}| uncommon| {T}: Add {C}. line_break {1}{W}: Add {C}.| None| None| None| \"The goblins are the only ones who can't be trusted.\" line_break —Gerrard of the Goblin Guild end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{W}| common| {T}: Add {C}.| 2| 2| None| \"The goblins are the only ones who can't be trusted.\" line_break —Gerrard of the Goblin Guild end_of_card Goblin Warrior| Creature"], "beam_5": ["Elf Goblin| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"I've never seen a goblin so angry.\" end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{G}| common| {T}: Goblin Warrior gets +1/+1 until end", "Elf Goblin| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"I've never seen a goblin so happy.\" end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{G}| common| {T}: Goblin Warrior gets +1/+1 until end", "Elf Goblin| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"I've never seen a goblin so angry.\" end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end", "Elf Goblin| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"I've never seen a goblin so happy.\" end_of_card Goblin Warrior| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end", "Elf Goblin| Creature — Goblin Warrior| {2}{G}| common| {T}: Target creature gets +1/+1 until end of turn.| 2| 2| None| \"I've never seen a goblin so angry.\" end_of_card Goblin Warrior| Creature — Goblin Warrior| {3}{G}| common| {T}: Goblin Warrior gets +1/+1 until end"], "sample_k=0_p=0_t=1": ["Elf Goblin Warlord| Creature — Goblin Warrior| {1}{B}| common| When you cycle another Goblin Warlord, you may have target Goblin Warlord deal 2 damage to you.| 1| 1| None| Most goblins pull power from Argor's waters, but Argor's is no stranger to the oiled ogre, breeding its taste for destruction both on both sides. end_of_card Lifeblood Drake| Creature — Drake| {2}{B}{B}| uncommon| Flying line_break Bloodthirst (This creature can't attack.) line_break Lifeblood Drake can't be blocked by creatures", "Elf Goblin we found in Nettle Fields appeared to be creatures of lesser intelligence. The goblins clung tightly to him, but he wasn't dragging them. He flung himself at her, tossing her guts into a binder's storage closet. end_of_card Cryptidar the Betrayer| Instant| {X}{W}{W}| uncommon| Cycle up to five target cards.| 0| 1| None| The Llanowar vampires avoided the Ravnican ruins without a shred of provocation. When their plague began to eat away at their castle, they understood exactly what had taken place. end_of", "Elf Goblin Rogue 3| 2| None| \"It doesn't look good on my wounds. If it ever got this far, it would have been a skeleton that hides behind a desk on a greener, inviting geyser before it surfaced.\" line_break —Tsoung, Gamerinancer end_of_card Elvish Stalker| Creature — Human Rogue Minion| {1}{W}{W}| uncommon| {1}, {T}: Target creature gets +1/+1 until end of turn.| 1| 1| None| \"Think of Erdad's house and the land. Look around you", "Elf Goblin—Grixis Runemark| Artifact| {3}| rare| Whenever any opponent casts a spell, you may transform Goblin Scout artifact creature with base power and toughness 2/1 until end of turn.| 4| 3| None| It does not divide its power between its owner and its champion. end_of_card Gentel Mystic| Creature — Wizard| {1}{U}| common| {1}{U}, {T}: Reveal the top card of your library. Put it into your hand and the rest on the bottom of your library in a random order.| 3| 1|", "Elf Goblin Shaman can't be blocked by enchant creatures. line_break Insolvency {2}{B} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)| 1| 1| None| \"You may want to take your mana instead of draining it quickly.\" end_of_card Prophet of Agony| Creature — Spirit| {2}{B}| mythic| Flying line_break Deepstate {2}{B}{B} (You may cast this card face down as a 2/2 creature for {3"], "sample_k=0_p=0_t=.7": ["Elf Goblin you control has \"{T}, Sacrifice a Goblin: Add {C}{C}. Draw a card.\"| None| None| None| \"Every goblin knows the greatest secret. Every sane goblin knows the second greatest secret.\" line_break —*Goblin Tales* end_of_card Prey| Instant| {1}{U}| common| Reveal the top card of your library. Put that card into your hand and the rest into your graveyard. Then you may put that card into your graveyard.| None| None| None| \"It's not the first time that you've been attacked by goblins", "Elf Goblin| {2}{W}{W}| common| As long as you control a Goblin, Goblin creatures you control get +1/+1.| 1| 2| None| \"The goblins in the jungle are fragile. But they're not fragile alone.\" line_break —Kerek, shapeshifter end_of_card Rio's Mettle| Instant| {1}{U}| common| Roil 3. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)| None| None| None", "Elf Goblin Shaman| {2}{G}| uncommon| {T}, Sacrifice a green Goblin: Target creature gets +1/+1 until end of turn.| None| None| None| \"The sword will end our battle.\" line_break —Kavu, goblin sharpshooter end_of_card Ogre Demon| Creature — Demon| {G}{G}| rare| Whenever Ogre Demon attacks, put a +1/+1 counter on it.| 5| 4| None| The first goblin warriors were led by the renowned troll, who had once defeated her on the famous Balduvian battlefield", "Elf Goblin Berserker {1}{W}| common| Whenever a Goblin dies, you may exile a nonland permanent from your graveyard.| 2| 1| None| The gnomes of this world speak with borrowed language and can sing with old melodies, but the gnomes of this world can sing with a new life. end_of_card Akros Mystic| Creature — Human Wizard| {3}{W}| uncommon| {1}{W}, {T}, Sacrifice Akros Mystic: Target player discards a card.| 2| 2| None| \"I built a temple of the akros, and if you", "Elf Goblin Berserker| {5}{R}| rare| Whenever you cast a spell with converted mana cost 5 or less, create a 1/1 white Goblin Warrior creature token with indestructible. line_break {T}: Create a 1/1 white Goblin Warrior creature token with indestructible.| 2| 2| None| None end_of_card Kozilek, the Land Recruiter| Legendary Creature — Goblin Warrior| {R}| rare| Whenever Kozilek, the Land Recruiter deals combat damage to a player, you may pay {1}. If you do, create"], "sample_k=50_p=0_t=1": ["Elf Goblin Shaman| {6}{W}| uncommon| *When Goblin Shaman enters the battlefield, scry 1. (Look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)| 2| 4| None| None end_of_card Quicksilver Dragon| Creature — Dragon| {2}{G}| common| None| 6| 2| None| \"My god, my god! My god!\" roared a dragon of my own, waving a dragon's wings in my direction. \"My sword! My blade! my sword! My shield!\" end_of_card Quicksilver Dragon's Feather| Enchantment| {5}{G}| common| None| None| 3| None| I've learned how to sharpen our swordsmanship with a few extra tricks. Perhaps they'll make us fly even faster if we're too much of a skittering frog. end_of_card Sporecane| Creature — Spore| {4}{G}{G}| common| None| 1| 1| None| What does a sporecane's body contain that can never be boiled down to the bones?", "Elf Goblin Shaman, Swampwalk| {2}{U}| uncommon| As an additional cost to cast this spell, sacrifice a land for each Swampwalk you control. line_break {B}, Exile a creature card from your graveyard: Choose one — {B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)| None| None| None| \"You have chosen to be here for the best part of a dozen years.\" end_of_card Sliding-Striped Merfolk| Creature — Merfolk Shaman| {4}{U}| common| At the beginning of your upkeep, Sliding-Striped Merfolk deals 1 damage to each opponent and each creature they control. Activate this ability only once each turn.| 4| 4| None| She's the best healer the elves ever had. end_of_card Spell-Bruiser| Creature — Merfolk Wizard| {3}{U}| common| Haste line_break You have reach as long as your opponents control two spellshapes, planeswalkers, or tapped lands.| 2| 2| None| \"The more spells cast, the more adept they become. They are skilled at knowing when to throw those", "Elf Goblin Barbarian| Creature — Goblin Rogue| {4}{R}| uncommon| Whenever a Goblin enters the battlefield under your control, put two +1/+1 counters on Goblin Barbarian.| 3| 2| None| \"I just hope this one lives long enough to make a fool of them.\" line_break —Baron Bannister end_of_card Arrogant Hauler| Creature — Minotaur Berserker| {2}{R}| common| When Arrogant Hauler enters the battlefield, tap target permanent an opponent controls.| 1| 1| None| \"I didn't take the reins—this was my first time in a combat.\" line_break —Lhovimar, goblin-rager end_of_card Ashbringer Cleric| Creature — Human Soldier| {5}{G}| uncommon| Flying line_break When Ashbringer Cleric enters the battlefield, you may exile target creature.| 3| 3| None| He can bend their hopes. end_of_card Blinding Eye Scout| Creature — Dog Scout| {1}{W}| common| Flash line_break When Blazing Eye Scout enters the battlefield, you may exile target creature. line_break {W}: Prevent", "Elf Goblin creature with power 8 or greater. line_break When Goblin Berserker enters the battlefield, put an extra +1/+1 counter on Goblin Berserker. Activate this ability only during your turn and only if Goblin Berserker has equipped.| 3| 3| None| None end_of_card Goblin Assault| Enchantment — Aura| {U}{U}| common| Enchant creature line_break Enchanted creature gets +3/+3. line_break Sacrifice another Aura: Target creature gets +3/+0 until end of turn.| None| None| None| The goblins of Yavimaya had fallen out of favor once more when they joined forces to bolster the goblin kingdom on its eastern borders. end_of_card Goblin Assault| Sorcery| {1}{U}| common| Target creature gains trample until end of turn. line_break Target creature doesn't untap during its controller's untap step.| None| None| None| None end_of_card Goblin Soldier| Creature — Goblin Soldier| {2}{U}{U}| uncommon| Goblin Soldier has menace as long as it's attacking.| 2| 2| None| The first goblin soldiers were often mistaken for the", "Elf Goblin Scout| Creature — Goblin Scout| {B}| common| {2}, Exile one enchantment card from a graveyard: Target Goblin Scout gets +1/+1 until end of turn.| 1| 1| None| None end_of_card Hammer of Fury| Sorcery| {4}{B}{B}{B}| rare| Hammer of Fury deals 4 damage to target opponent or planeswalker. If the damage would be dealt to a permanent with power 4 or greater, put a +1/+1 counter on it instead.| None| None| None| None end_of_card Hammer of Fury's Sliver| Creature — Goblin Warrior| {3}{B}{B}| rare| {1}, Sacrifice Hammer of Fury: Target creature you control gets +2/+0 until end of turn.| 2| 2| None| \"He who destroys the world suffers as he who destroys the earth..... My thoughts are no more—no more—less dreadful.\" line_break —Taeus, paladin end_of_card Hammer of Doom| Sorcery| {1}{B}{B}| rare| Hammer of Doom deals 6 damage to target creature. If the damage is"], "sample_k=0_p=.92_t=1": ["Elf Goblin Shaman| {W}{W}| uncommon| Remove an enchantment from another target creature: Create a token that's a copy of the creature. Activate this ability only once each turn and only once each turn.| 1| 4| None| None end_of_card Primarch of Dusk| Artifact| {3}| uncommon| {W}, {T}: Create a 1/1 colorless Eldrazi Scion creature token.| None| None| None| Archon Efimar approved of Efimar's choice of a sanctuary as he extracted information from the minds of his subjects. As Efimar raised his dead siblings' children, Jace is tracking them. end_of_card Pale Illusionist| Artifact Creature — Illusion| {3}| rare| Morph {2}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.) line_break When Pale Illusionist dies, target creature you control gains shroud until end of turn.| 2| 2| None| None end_of_card Plated Worker| Artifact Creature — Insect| {3}| common| Sacrifice Plated Worker: Destroy target", "Elf Goblin Shaman, Swampwalk| {2}{U}| uncommon| As an additional cost to cast this spell, sacrifice a land. line_break Players can't cast spells from their graveyard.| None| None| None| One for the Goblins' meals and the excellent food of home. end_of_card Haunt the Ancients| Sorcery| {1}{U}{U}| mythic| Kicker {2}{U} (You may pay an additional {2}{U} as you cast this spell.) line_break Draw a card.| None| None| None| The home had lost hope in the ways of life. end_of_card Hammerfire| Enchantment| {4}{U}{U}| uncommon| Until end of turn, creatures that share a color with Hammerfire can't block or be blocked by black creatures.| None| None| None| \"We must begin our escape from the mountain.\" line_break —Joraga saying end_of_card Onechanis Black Rose| Enchantment Creature — Elf Shaman| {3}{U}| uncommon| ({3}{U}, Exile this card from your graveyard: Put a +1/+1 counter on target creature you", "Elf Goblin Barbarian Jervi-Jhov, Reveler of Mana| Legendary Creature — Goblin Archer| {4}{U}| common| Lifelink line_break Haste line_break Whenever you cast an instant spell, you may have a creature you control gain shroud until end of turn. (That creature can't attack.)| 2| 2| None| In time, most of the orcas have walked through the deadly chasm. Their bodies keep them from failing and returning. end_of_card Lure of Magic| Instant| {3}{U}| uncommon| Target creature becomes a 6/6 creature with flying.| None| None| None| When sorcerers use magic to explain their acts, the masses quickly learn their arts. end_of_card Moonglare| Sorcery| {2}{U}| uncommon| Target player shuffles their library. (If any cards are in your graveyard, you may put a card from among them into your hand and pay the rest as you cast this spell.)| None| None| None| \"Imagine yourself in a high mountain, facing a dark and dangerous landscape—and well you may fall into a trap—but you won't. The gods in your heart will guide", "Elf Goblin creature with power 8 or greater. line_break When Lizardfolk Protagonist dies, put an extra +1/+1 counter on Goblin Constructs.| 2| 4| None| Like steel, Sandgoblins use stone as their weapon. end_of_card Shadowstroke| Enchantment — Aura| {4}{W}{W}| uncommon| Enchant land line_break Enchanted land has \"{T}: This land becomes the color of your choice until end of turn.\" line_break At the beginning of each player's upkeep, that player discards a card. line_break When Shadowstroke leaves the battlefield, target player sacrifices a land.| None| None| None| None end_of_card Ugin's Bestiary| Artifact Creature — Construct| {4}| common| {T}: You may put up to one permanent card with converted mana cost 4 or less from a single graveyard on top of your library.| 1| 1| None| \"We reached Silumgar, but it looked like we were flying across it.\" end_of_card Witch Queen| Creature — Djinn| {1}{W}{W}| rare| Whenever Witch Queen or another permanent dies, create a 3/3", "Elf Goblin Scout| Creature — Goblin Scout| {B}| common| {2}, {T}: Discard a card.| 1| 3| None| \"Many goblins have evolved cunning enough to claim the playground. Perhaps a few wish their adventuring habits were as successful as those gained from their competition.\" line_break —Darren Beresford, Dwarven explorer end_of_card Mold-Masked Ogre| Creature — Ogre| {4}{B}| common| When Mold-Masked Ogre enters the battlefield, counter target spell.| 5| 5| None| \"We have become friends. We will find out why each other is the same.\" line_break —Archmage Borko end_of_card Rainbow Scales| Enchantment — Aura| {3}{B}{R}| common| Enchant creature line_break Enchanted creature can't attack. line_break {B}: Reveal your hand.| None| None| None| The Troggs were still laughing during his final stanza, and the jolly squirrel got up and ran with the steady flow. end_of_card Skittering Smasher| Creature — Snake| {B}| common| {2}, {"], "sample_k=50_p=.92_t=1": ["Elf Goblin Shaman| {W}{W}| uncommon| {4}{W}, {T}: Target creature gets +1/+1 until end of turn.| 1| 3| None| \"I thought this creature was a beast when I saw its eyes.\" end_of_card Kathryn Griffin| Creature — Griffin Rogue| {2}{W}{W}| uncommon| First strike| 3| 2| None| \"We are not the first to claim the title of *Arcanist Warrior*. We have never been. It's an honor to be on our feet. You are welcome to join us.\" line_break —Kathryn of Ulfi end_of_card Kithkin, the Climb| Legendary Creature — Human Cleric| {2}{W}{W}| rare| When Kathryn Griffin enters the battlefield, target player draws two cards.| 4| 3| None| \"Mystic armor does not have a place on my earth.\" end_of_card Kolaghan Griffin| Creature — Griffin| {3}{W}{W}| uncommon| First strike| 4| 4| None| \"She knows when she sees a blade, that the blade is the path of the snake.", "Elf Goblin Shaman, Swampwalk| {2}{U}| uncommon| As an additional cost to cast this spell, sacrifice a land. line_break At the beginning of your upkeep, sacrifice another land.| 2| 2| None| The Goblins' lives lie in the depths of their stomachs. end_of_card Heralds of the Forest| Creature — Human Monk| {1}{U}| uncommon| Haste line_break {1}{U}: Heralds of the Forest gains haste until end of turn.| 1| 3| None| The forest is rich and vast—but the land is in one. end_of_card Krogan War Machine| Creature — Beast| {4}{R}{R}| common| Flying line_break {1}{R}{R}: Rogan War Machine gets +X/+X until end of turn, where X is the number of Humans you control.| 4| 2| None| \"We are in the dark land. You must stay indoors.\" end_of_card Prelude| Enchantment — Aura| {1}{R}| uncommon| Enchant creature line_break Enchanted creature can't attack or block.| None| None| None", "Elf Goblin {1}{W}| common| Whenever you cycle Thalia's Gift, gain control of Thalia's Gift.| 2| 1| None| \"I have known a wizard's dreams. I have learned his tricks.\" line_break —Ojutai end_of_card Thalia's Tome| Artifact| {5}| uncommon| {3}, {T}: Put target artifact card from your graveyard onto the battlefield tapped.| None| None| None| For its power, Thalia's Tome boasts the best name in the guild, and its price is equal to the symbol on the inscription. end_of_card Thalia's Tome Vial| Artifact| {4}| uncommon| {4}, {T}: Add one mana of any color.| None| None| None| \"It's called the Tome of Sacrifice. All creatures who would die to me owe it a place of their own to lay their hands on.\" line_break —Glissa of the Merfolk end_of_card Thalia's Tome, Soulshift| Artifact| {4}| rare| {2}, {T}: Untap target artifact. It gains indestructible until end of turn.| None| None", "Elf Goblin creature with power 8 or greater. line_break When Goblin Berserker enters the battlefield, put an extra +1/+1 counter on Goblin Berserker.| None| None| None| None end_of_card Riptide Troll| Creature — Troll| {1}{G}| common| Flying line_break Cycling {2} ({2}, Discard this card: Draw a card.) line_break You may have Riptide Troll enter the battlefield as though it weren't a regular land.| 2| 2| None| None end_of_card Trucker| Creature — Goblin Shaman| {3}{G}{G}| uncommon| {1}{G}: Gruul creatures you control get +2/+0 until end of turn.| 4| 4| None| \"You are truly mine. You will make my days as my father's.\" end_of_card Thrabenid Growth| Instant| {3}{G}{G}| rare| Destroy target creature with power 6 or greater.| None| None| None| \"There is no such thing as a good harvest. None of us can afford it.\" line_break —Gideon Jura end_of_card Vampire Skirm", "Elf Goblin Scout| Creature — Goblin Scout| {B}| common| {2}, {T}: Discard a card.| 1| 3| None| \"The goblins have only known us for a while. I don't like them all that much. But they want to share a meal.\" line_break —Niv-Mizzet end_of_card Breadbinder Mage| Creature — Goblin Warrior| {2}{B}| common| ({2}{B}, Sacrifice a land: Draw a card.) line_break {B}: Breadbinder Mage deals 3 damage to any target.| 3| 4| None| Bats were plentiful at the fort, and goblins had little reason to doubt its bounty. end_of_card Curse of Night's Watch| Enchantment| {3}{B}| uncommon| Whenever Curse of Night's Watch deals combat damage to a player, that player gains control of a creature they control until end of turn.| None| None| None| None end_of_card Deadeye Assassin| Creature — Zombie Assassin| {1}{B}| uncommon| {1}{B}, {T}: Target creature loses all abilities until end of turn.| 1|"]}